astb_relise/src/DataProcessors/УправлениеЗапасами/УправлениеЗапасами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеЗапасами</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоДнейПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоДнейПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказатьСУчетомКараснойЛинии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетЗапасов</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Период1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ежедневно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ежемесячно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеКоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеКоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекомендуетсяКЗаказу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекомендуетсяМинимально</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекомендуетсяМаксимально</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КраснаяЛиния</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСбыта</name>
      <type>
        <types>EnumRef.СтатусыСбыта</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьПриФормированииЗаказаПоставщику</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

astb_relise/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/AccumulationRegisters/ЗаказыПоставщику/ЗаказыПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщику</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыдачи</name>
    <type>
      <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/ПараметрыУправленияЗапасами/ПараметрыУправленияЗапасами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыУправленияЗапасами</name>
  <resources>
    <name>МинимальноеКоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/КраснаяЛиния/КраснаяЛиния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КраснаяЛиния</name>
  <comment>Страховой запас</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/СрокиДоставкиСИЗ/СрокиДоставкиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СрокиДоставкиСИЗ</name>
  <resources>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дискретность</name>
    <type>
      <types>EnumRef.ДоступныеПериодыОтчета</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/СпособыСозданияЗаказовПоставщику/СпособыСозданияЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСозданияЗаказовПоставщику</name>
  <enumValues>
    <name>СформированВручную</name>
  </enumValues>
  <enumValues>
    <name>СформированУправлениемЗапасами</name>
  </enumValues>
  <enumValues>
    <name>СформированФормированиемЗаказовПоставщику</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/DataProcessors/УправлениеЗапасами/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетОстатковПоОрганизации = НЕ ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации");
	
	Если УчетОстатковПоОрганизации Тогда
		РежимУчетаОстатков = "учет остатков ведется по организациям";
	Иначе
		РежимУчетаОстатков = "учет остатков не ведется по организациям";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "Управление запасами (" + РежимУчетаОстатков + ")";
	
	УстановитьПараметрВСпискеНоменклатуры();
	
	Объект.Поставщик = Справочники.Контрагенты.ВостокСервис;
	
	Объект.НачалоПериода 	= НачалоГода(ТекущаяДата());
	Объект.КонецПериода 	= КонецМесяца(НачалоМесяца(ТекущаяДата())-1);
	
	ПериодАнализа.ДатаНачала 	= Объект.НачалоПериода;
	ПериодАнализа.ДатаОкончания = Объект.КонецПериода;
	
	Объект.МинимальноеКоличествоДнейПоУмолчанию 	= 60;
	Объект.МаксимальноеКоличествоДнейПоУмолчанию 	= 90;
	
	ОбработатьИзменениеПериодаАнализа();
	
	НастроитьКолонкиТаблицы();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетНаСервере()
	
	//+Смирнов 25.05.2021 № 56724
	ТЗСклады = Объект.Склады.Выгрузить(,"Склад");
	//-Смирнов 25.05.2021 № 56724
	
	Запрос = Новый Запрос;
	
	Если КоличествоМесяцев > 12 Тогда //колонки периодов - это года
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОстаткиНоменклатурыОбороты.Период, ГОД) КАК Период,
		|	ОстаткиНоменклатурыОбороты.Организация КАК Организация,
		|	ОстаткиНоменклатурыОбороты.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ОстаткиНоменклатурыОбороты.КоличествоРасход) КАК Отгужено
		|ПОМЕСТИТЬ ВТ_Выдача
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &ОрганизацияДляОстатков
		|				И Склад В (&Склад)
		|				И (Номенклатура.Поставщик = &Поставщик
		|					ИЛИ &Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) КАК ОстаткиНоменклатурыОбороты
		|ГДЕ
		|	(ОстаткиНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ПеремещениеНоменклатуры
		|			ИЛИ ОстаткиНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ВыдачаДежурныхСредствЗащиты
		|			ИЛИ ОстаткиНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ВыдачаСредствЗащитыСотруднику)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНоменклатурыОбороты.Номенклатура,
		|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры,
		|	ОстаткиНоменклатурыОбороты.Организация,
		|	НАЧАЛОПЕРИОДА(ОстаткиНоменклатурыОбороты.Период, ГОД)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Организация КАК Организация,
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК Остаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(, Склад В (&Склад)) КАК ОстаткиНоменклатурыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНоменклатурыОстатки.Организация,
		|	ОстаткиНоменклатурыОстатки.Номенклатура,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыПоставщикуОстатки.Организация КАК Организация,
		|	ЗаказыПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыПоставщикуОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ЗаказыПоставщикуОстатки.КоличествоОстаток) КАК Заказано
		|ПОМЕСТИТЬ ВТ_Заказано
		|ИЗ
		//АсТБ_Alexey_56724_********************************************************************
		|	РегистрНакопления.ЗаказыПоставщику.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Склад В (&Склад)) КАК ЗаказыПоставщикуОстатки
		//АсТБ_Alexey_56724_********************************************************************
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПоставщикуОстатки.Организация,
		|	ЗаказыПоставщикуОстатки.Номенклатура,
		|	ЗаказыПоставщикуОстатки.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выдача.Период КАК Период,
		|	ВТ_Выдача.Номенклатура КАК Номенклатура,
		|	ВТ_Выдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЕСТЬNULL(ПараметрыУправленияЗапасами.МинимальноеКоличествоДней, &МинимальноеКоличествоДней) КАК МинимальноеКоличествоДней,
		|	ЕСТЬNULL(ПараметрыУправленияЗапасами.МаксимальноеКоличествоДней, &МаксимальноеКоличествоДней) КАК МаксимальноеКоличествоДней,
		|	ВТ_Выдача.Отгужено КАК Отгужено,
		|	ЕСТЬNULL(ВТ_Остатки.Остаток, 0) КАК Остаток,
		|	ЕСТЬNULL(ВТ_Заказано.Заказано, 0) КАК Заказано
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	ВТ_Выдача КАК ВТ_Выдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУправленияЗапасами КАК ПараметрыУправленияЗапасами
		|		ПО ВТ_Выдача.Организация = ПараметрыУправленияЗапасами.Организация
		|			И ВТ_Выдача.Номенклатура = ПараметрыУправленияЗапасами.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ПараметрыУправленияЗапасами.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Выдача.Организация = ВТ_Остатки.Организация
		|			И ВТ_Выдача.Номенклатура = ВТ_Остатки.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ВТ_Остатки.ХарактеристикаНоменклатуры
		//АсТБ_Alexey_56724_********************************************************************
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказано КАК ВТ_Заказано
		|		ПО ВТ_Выдача.Номенклатура = ВТ_Заказано.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ВТ_Заказано.ХарактеристикаНоменклатуры
		//АсТБ_Alexey_56724_********************************************************************
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПериодов.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ТаблицаПериодов
		|ИЗ
		|	&ТаблицаПериодов КАК ТаблицаПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Результат.Номенклатура КАК Номенклатура,
		|	ВТ_Результат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Результат.МинимальноеКоличествоДней КАК МинимальноеКоличествоДней,
		|	ВТ_Результат.МаксимальноеКоличествоДней КАК МаксимальноеКоличествоДней,
		|	ВТ_Результат.Остаток КАК Остаток,
		|	ВТ_Результат.Заказано КАК Заказано
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ТаблицаПериодов.Период КАК Период,
		|	ВТ_Номенклатура.МинимальноеКоличествоДней КАК МинимальноеКоличествоДней,
		|	ВТ_Номенклатура.МаксимальноеКоличествоДней КАК МаксимальноеКоличествоДней,
		|	ВТ_Номенклатура.Остаток КАК Остаток,
		|	ВТ_Номенклатура.Заказано КАК Заказано
		|ПОМЕСТИТЬ ВТ_НоменклатураСПериодами
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура,
		|	ВТ_ТаблицаПериодов КАК ВТ_ТаблицаПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КраснаяЛиния.Номенклатура КАК Номенклатура,
		|	КраснаяЛиния.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КраснаяЛиния.Количество КАК КраснаяЛиния
		|ПОМЕСТИТЬ ВТ_КраснаяЛиния
		|ИЗ
		|	РегистрСведений.КраснаяЛиния КАК КраснаяЛиния
		|ГДЕ
		|	КраснаяЛиния.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиДоставкиСИЗ.Номенклатура КАК Номенклатура,
		|	СрокиДоставкиСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА СрокиДоставкиСИЗ.Дискретность = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
		|			ТОГДА СрокиДоставкиСИЗ.КоличествоПериодов
		|		ИНАЧЕ СрокиДоставкиСИЗ.КоличествоПериодов * 30
		|	КОНЕЦ КАК СрокДоставки
		|ПОМЕСТИТЬ ВТ_СрокаДоставки
		|ИЗ
		|	РегистрСведений.СрокиДоставкиСИЗ КАК СрокиДоставкиСИЗ
		|ГДЕ
		|	СрокиДоставкиСИЗ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураСПериодами.Номенклатура КАК Номенклатура,
		|	ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_НоменклатураСПериодами.Период КАК Период,
		|	ВТ_НоменклатураСПериодами.МинимальноеКоличествоДней КАК МинимальноеКоличествоДней,
		|	ВТ_НоменклатураСПериодами.МаксимальноеКоличествоДней КАК МаксимальноеКоличествоДней,
		|	ВТ_НоменклатураСПериодами.Остаток КАК Остаток,
		|	ВТ_НоменклатураСПериодами.Заказано КАК Заказано,
		|	ЕСТЬNULL(ВТ_Результат.Отгужено, 0) КАК Отгужено,
		|	ЕСТЬNULL(ВТ_СрокаДоставки.СрокДоставки, 0) КАК СрокДоставки,
		|	ЕСТЬNULL(ВТ_КраснаяЛиния.КраснаяЛиния, 0) КАК КраснаяЛиния
		|ИЗ
		|	ВТ_НоменклатураСПериодами КАК ВТ_НоменклатураСПериодами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Результат КАК ВТ_Результат
		|		ПО ВТ_НоменклатураСПериодами.Номенклатура = ВТ_Результат.Номенклатура
		|			И ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры = ВТ_Результат.ХарактеристикаНоменклатуры
		|			И ВТ_НоменклатураСПериодами.Период = ВТ_Результат.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокаДоставки КАК ВТ_СрокаДоставки
		|		ПО ВТ_НоменклатураСПериодами.Номенклатура = ВТ_СрокаДоставки.Номенклатура
		|			И ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры = ВТ_СрокаДоставки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КраснаяЛиния КАК ВТ_КраснаяЛиния
		|		ПО ВТ_НоменклатураСПериодами.Номенклатура = ВТ_КраснаяЛиния.Номенклатура
		|			И ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры = ВТ_КраснаяЛиния.ХарактеристикаНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_НоменклатураСПериодами.Номенклатура.Наименование,
		|	ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры.КодSAP,
		|	ВТ_НоменклатураСПериодами.Период
		|ИТОГИ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры";		
		
	Иначе  		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОстаткиНоменклатурыОбороты.Период, МЕСЯЦ) КАК Период,
		|	ОстаткиНоменклатурыОбороты.Организация КАК Организация,
		|	ОстаткиНоменклатурыОбороты.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ОстаткиНоменклатурыОбороты.КоличествоРасход) КАК Отгужено
		|ПОМЕСТИТЬ ВТ_Выдача
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &ОрганизацияДляОстатков
		|				И Склад В (&Склад)
		|				И (Номенклатура.Поставщик = &Поставщик
		|					ИЛИ &Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) КАК ОстаткиНоменклатурыОбороты
		|ГДЕ
		|	(ОстаткиНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ПеремещениеНоменклатуры
		|			ИЛИ ОстаткиНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ВыдачаДежурныхСредствЗащиты
		|			ИЛИ ОстаткиНоменклатурыОбороты.Регистратор ССЫЛКА Документ.ВыдачаСредствЗащитыСотруднику)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНоменклатурыОбороты.Номенклатура,
		|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры,
		|	ОстаткиНоменклатурыОбороты.Организация,
		|	НАЧАЛОПЕРИОДА(ОстаткиНоменклатурыОбороты.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Организация КАК Организация,
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК Остаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(, Склад В (&Склад)) КАК ОстаткиНоменклатурыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНоменклатурыОстатки.Организация,
		|	ОстаткиНоменклатурыОстатки.Номенклатура,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыПоставщикуОстатки.Организация КАК Организация,
		|	ЗаказыПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыПоставщикуОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ЗаказыПоставщикуОстатки.КоличествоОстаток) КАК Заказано
		|ПОМЕСТИТЬ ВТ_Заказано
		|ИЗ
		//АсТБ_Alexey_56724_********************************************************************
		|	РегистрНакопления.ЗаказыПоставщику.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Склад В (&Склад)) КАК ЗаказыПоставщикуОстатки
		//АсТБ_Alexey_56724_********************************************************************
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПоставщикуОстатки.Организация,
		|	ЗаказыПоставщикуОстатки.Номенклатура,
		|	ЗаказыПоставщикуОстатки.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выдача.Период КАК Период,
		|	ВТ_Выдача.Номенклатура КАК Номенклатура,
		|	ВТ_Выдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЕСТЬNULL(ПараметрыУправленияЗапасами.МинимальноеКоличествоДней, &МинимальноеКоличествоДней) КАК МинимальноеКоличествоДней,
		|	ЕСТЬNULL(ПараметрыУправленияЗапасами.МаксимальноеКоличествоДней, &МаксимальноеКоличествоДней) КАК МаксимальноеКоличествоДней,
		|	ВТ_Выдача.Отгужено КАК Отгужено,
		|	ЕСТЬNULL(ВТ_Остатки.Остаток, 0) КАК Остаток,
		|	ЕСТЬNULL(ВТ_Заказано.Заказано, 0) КАК Заказано
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	ВТ_Выдача КАК ВТ_Выдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУправленияЗапасами КАК ПараметрыУправленияЗапасами
		|		ПО ВТ_Выдача.Организация = ПараметрыУправленияЗапасами.Организация
		|			И ВТ_Выдача.Номенклатура = ПараметрыУправленияЗапасами.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ПараметрыУправленияЗапасами.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Выдача.Организация = ВТ_Остатки.Организация
		|			И ВТ_Выдача.Номенклатура = ВТ_Остатки.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ВТ_Остатки.ХарактеристикаНоменклатуры
		//АсТБ_Alexey_56724_********************************************************************
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказано КАК ВТ_Заказано
		|		ПО ВТ_Выдача.Номенклатура = ВТ_Заказано.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ВТ_Заказано.ХарактеристикаНоменклатуры
		//АсТБ_Alexey_56724_********************************************************************
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПериодов.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ТаблицаПериодов
		|ИЗ
		|	&ТаблицаПериодов КАК ТаблицаПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Результат.Номенклатура КАК Номенклатура,
		|	ВТ_Результат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Результат.МинимальноеКоличествоДней КАК МинимальноеКоличествоДней,
		|	ВТ_Результат.МаксимальноеКоличествоДней КАК МаксимальноеКоличествоДней,
		|	ВТ_Результат.Остаток КАК Остаток,
		|	ВТ_Результат.Заказано КАК Заказано
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ТаблицаПериодов.Период КАК Период,
		|	ВТ_Номенклатура.МинимальноеКоличествоДней КАК МинимальноеКоличествоДней,
		|	ВТ_Номенклатура.МаксимальноеКоличествоДней КАК МаксимальноеКоличествоДней,
		|	ВТ_Номенклатура.Остаток КАК Остаток,
		|	ВТ_Номенклатура.Заказано КАК Заказано
		|ПОМЕСТИТЬ ВТ_НоменклатураСПериодами
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура,
		|	ВТ_ТаблицаПериодов КАК ВТ_ТаблицаПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КраснаяЛиния.Номенклатура КАК Номенклатура,
		|	КраснаяЛиния.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КраснаяЛиния.Количество КАК КоаснаяЛиния
		|ПОМЕСТИТЬ ВТ_КраснаяЛиния
		|ИЗ
		|	РегистрСведений.КраснаяЛиния КАК КраснаяЛиния
		|ГДЕ
		|	КраснаяЛиния.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиДоставкиСИЗ.Номенклатура КАК Номенклатура,
		|	СрокиДоставкиСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА СрокиДоставкиСИЗ.Дискретность = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
		|			ТОГДА СрокиДоставкиСИЗ.КоличествоПериодов
		|		ИНАЧЕ СрокиДоставкиСИЗ.КоличествоПериодов * 30
		|	КОНЕЦ КАК СрокДоставки
		|ПОМЕСТИТЬ ВТ_СрокиДоставки
		|ИЗ
		|	РегистрСведений.СрокиДоставкиСИЗ КАК СрокиДоставкиСИЗ
		|ГДЕ
		|	СрокиДоставкиСИЗ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураСПериодами.Номенклатура КАК Номенклатура,
		|	ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_НоменклатураСПериодами.Период КАК Период,
		|	ВТ_НоменклатураСПериодами.МинимальноеКоличествоДней КАК МинимальноеКоличествоДней,
		|	ВТ_НоменклатураСПериодами.МаксимальноеКоличествоДней КАК МаксимальноеКоличествоДней,
		|	ВТ_НоменклатураСПериодами.Остаток КАК Остаток,
		|	ВТ_НоменклатураСПериодами.Заказано КАК Заказано,
		|	ЕСТЬNULL(ВТ_Результат.Отгужено, 0) КАК Отгужено,
		|	ЕСТЬNULL(ВТ_СрокиДоставки.СрокДоставки, 0) КАК СрокДоставки,
		|	ЕСТЬNULL(ВТ_КраснаяЛиния.КоаснаяЛиния, 0) КАК КраснаяЛиния
		|ИЗ
		|	ВТ_НоменклатураСПериодами КАК ВТ_НоменклатураСПериодами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Результат КАК ВТ_Результат
		|		ПО ВТ_НоменклатураСПериодами.Номенклатура = ВТ_Результат.Номенклатура
		|			И ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры = ВТ_Результат.ХарактеристикаНоменклатуры
		|			И ВТ_НоменклатураСПериодами.Период = ВТ_Результат.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиДоставки КАК ВТ_СрокиДоставки
		|		ПО ВТ_НоменклатураСПериодами.Номенклатура = ВТ_СрокиДоставки.Номенклатура
		|			И ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры = ВТ_СрокиДоставки.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КраснаяЛиния КАК ВТ_КраснаяЛиния
		|		ПО ВТ_НоменклатураСПериодами.Номенклатура = ВТ_КраснаяЛиния.Номенклатура
		|			И ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры = ВТ_КраснаяЛиния.ХарактеристикаНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_НоменклатураСПериодами.Номенклатура.Наименование,
		|	ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры.КодSAP,
		|	ВТ_НоменклатураСПериодами.Период
		|ИТОГИ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры";		
	КонецЕсли;
	
	//+Смирнов 24.05.2021 № 56724
	Если Объект.ЗаказатьСУчетомКараснойЛинии Тогда
		ЗапросКЛ = Новый Запрос;
		ЗапросКЛ.Текст = 
		"ВЫБРАТЬ
		|	КраснаяЛиния.Организация КАК Организация,
		|	КраснаяЛиния.Номенклатура КАК Номенклатура,
		|	КраснаяЛиния.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(КраснаяЛиния.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Выдача
		|ИЗ
		|	РегистрСведений.КраснаяЛиния КАК КраснаяЛиния
		|
		|СГРУППИРОВАТЬ ПО
		|	КраснаяЛиния.Организация,
		|	КраснаяЛиния.Номенклатура,
		|	КраснаяЛиния.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Организация КАК Организация,
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК Остаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(, Склад В (&Склад)) КАК ОстаткиНоменклатурыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНоменклатурыОстатки.Организация,
		|	ОстаткиНоменклатурыОстатки.Номенклатура,
		|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыПоставщикуОстатки.Организация КАК Организация,
		|	ЗаказыПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыПоставщикуОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ЗаказыПоставщикуОстатки.КоличествоОстаток) КАК Заказано
		|ПОМЕСТИТЬ ВТ_Заказано
		//АсТБ_Alexey_56724_********************************************************************
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщику.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Склад В (&Склад)) КАК ЗаказыПоставщикуОстатки
		//АсТБ_Alexey_56724_********************************************************************
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПоставщикуОстатки.Организация,
		|	ЗаказыПоставщикуОстатки.Номенклатура,
		|	ЗаказыПоставщикуОстатки.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выдача.Номенклатура КАК Номенклатура,
		|	ВТ_Выдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЕСТЬNULL(ПараметрыУправленияЗапасами.МинимальноеКоличествоДней, &МинимальноеКоличествоДней) КАК МинимальноеКоличествоДней,
		|	ЕСТЬNULL(ПараметрыУправленияЗапасами.МаксимальноеКоличествоДней, &МаксимальноеКоличествоДней) КАК МаксимальноеКоличествоДней,
		|	ЕСТЬNULL(ВТ_Остатки.Остаток, 0) КАК Остаток,
		|	ЕСТЬNULL(ВТ_Заказано.Заказано, 0) КАК Заказано,
		|	ВТ_Выдача.Количество КАК КраснаяЛиния
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	ВТ_Выдача КАК ВТ_Выдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУправленияЗапасами КАК ПараметрыУправленияЗапасами
		|		ПО ВТ_Выдача.Организация = ПараметрыУправленияЗапасами.Организация
		|			И ВТ_Выдача.Номенклатура = ПараметрыУправленияЗапасами.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ПараметрыУправленияЗапасами.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Выдача.Организация = ВТ_Остатки.Организация
		|			И ВТ_Выдача.Номенклатура = ВТ_Остатки.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ВТ_Остатки.ХарактеристикаНоменклатуры
		//АсТБ_Alexey_56724_********************************************************************
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказано КАК ВТ_Заказано
		|		ПО ВТ_Выдача.Номенклатура = ВТ_Заказано.Номенклатура
		|			И ВТ_Выдача.ХарактеристикаНоменклатуры = ВТ_Заказано.ХарактеристикаНоменклатуры
		//АсТБ_Alexey_56724_********************************************************************
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПериодов.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ТаблицаПериодов
		|ИЗ
		|	&ТаблицаПериодов КАК ТаблицаПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Результат.Номенклатура КАК Номенклатура,
		|	ВТ_Результат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_Результат.МинимальноеКоличествоДней КАК МинимальноеКоличествоДней,
		|	ВТ_Результат.МаксимальноеКоличествоДней КАК МаксимальноеКоличествоДней,
		|	ВТ_Результат.Остаток КАК Остаток,
		|	ВТ_Результат.Заказано КАК Заказано,
		|	ВТ_Результат.КраснаяЛиния КАК КраснаяЛиния
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ТаблицаПериодов.Период КАК Период,
		|	СУММА(ВТ_Номенклатура.МинимальноеКоличествоДней) КАК МинимальноеКоличествоДней,
		|	СУММА(ВТ_Номенклатура.МаксимальноеКоличествоДней) КАК МаксимальноеКоличествоДней,
		|	СУММА(ВТ_Номенклатура.Остаток) КАК Остаток,
		|	СУММА(ВТ_Номенклатура.Заказано) КАК Заказано,
		|	СУММА(ВТ_Номенклатура.КраснаяЛиния) КАК КраснаяЛиния
		|ПОМЕСТИТЬ ВТ_НоменклатураСПериодами
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура,
		|	ВТ_ТаблицаПериодов КАК ВТ_ТаблицаПериодов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.ХарактеристикаНоменклатуры,
		|	ВТ_ТаблицаПериодов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрокиДоставкиСИЗ.Номенклатура КАК Номенклатура,
		|	СрокиДоставкиСИЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА СрокиДоставкиСИЗ.Дискретность = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.День)
		|			ТОГДА СрокиДоставкиСИЗ.КоличествоПериодов
		|		ИНАЧЕ СрокиДоставкиСИЗ.КоличествоПериодов * 30
		|	КОНЕЦ КАК СрокДоставки
		|ПОМЕСТИТЬ ВТ_СрокаДоставки
		|ИЗ
		|	РегистрСведений.СрокиДоставкиСИЗ КАК СрокиДоставкиСИЗ
		|ГДЕ
		|	СрокиДоставкиСИЗ.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураСПериодами.Номенклатура КАК Номенклатура,
		|	ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_НоменклатураСПериодами.Период КАК Период,
		|	ВТ_НоменклатураСПериодами.МинимальноеКоличествоДней КАК МинимальноеКоличествоДней,
		|	ВТ_НоменклатураСПериодами.МаксимальноеКоличествоДней КАК МаксимальноеКоличествоДней,
		|	ВТ_НоменклатураСПериодами.Остаток КАК Остаток,
		|	ВТ_НоменклатураСПериодами.Заказано КАК Заказано,
		|	ЕСТЬNULL(ВТ_СрокаДоставки.СрокДоставки, 0) КАК СрокДоставки,
		|	ЕСТЬNULL(ВТ_НоменклатураСПериодами.КраснаяЛиния, 0) КАК КраснаяЛиния
		|ИЗ
		|	ВТ_НоменклатураСПериодами КАК ВТ_НоменклатураСПериодами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Результат КАК ВТ_Результат
		|		ПО ВТ_НоменклатураСПериодами.Номенклатура = ВТ_Результат.Номенклатура
		|			И ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры = ВТ_Результат.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокаДоставки КАК ВТ_СрокаДоставки
		|		ПО ВТ_НоменклатураСПериодами.Номенклатура = ВТ_СрокаДоставки.Номенклатура
		|			И ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры = ВТ_СрокаДоставки.ХарактеристикаНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_НоменклатураСПериодами.Номенклатура.Наименование,
		|	ВТ_НоменклатураСПериодами.ХарактеристикаНоменклатуры.КодSAP,
		|	ВТ_НоменклатураСПериодами.Период
		|ИТОГИ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры";
		
		ЗапросКЛ.УстановитьПараметр("ОрганизацияДляОстатков",		?(УчетОстатковПоОрганизации,Объект.Организация,Справочники.Организации.ПустаяСсылка()));
		ЗапросКЛ.УстановитьПараметр("Организация",				Объект.Организация);
		ЗапросКЛ.УстановитьПараметр("Поставщик",					?(ЗначениеЗаполнено(Объект.Поставщик),Объект.Поставщик,Справочники.Контрагенты.ПустаяСсылка()));
		ЗапросКЛ.УстановитьПараметр("Склад",						ТЗСклады);
		ЗапросКЛ.УстановитьПараметр("НачалоПериода",				Объект.НачалоПериода);
		ЗапросКЛ.УстановитьПараметр("КонецПериода",				Объект.КонецПериода);
		ЗапросКЛ.УстановитьПараметр("МинимальноеКоличествоДней",	Объект.МинимальноеКоличествоДнейПоУмолчанию);
		ЗапросКЛ.УстановитьПараметр("МаксимальноеКоличествоДней",	Объект.МаксимальноеКоличествоДнейПоУмолчанию);
	КонецЕсли;
	//-Смирнов 24.05.2021 № 56724
	
	Запрос.УстановитьПараметр("ОрганизацияДляОстатков",		?(УчетОстатковПоОрганизации,Объект.Организация,Справочники.Организации.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Организация",				Объект.Организация);
	Запрос.УстановитьПараметр("Поставщик",					?(ЗначениеЗаполнено(Объект.Поставщик),Объект.Поставщик,Справочники.Контрагенты.ПустаяСсылка()));
	//+Смирнов 25.05.2021 № 56724
	Запрос.УстановитьПараметр("Склад",						ТЗСклады);//Объект.Склады);
	//-Смирнов 25.05.2021 № 56724
	Запрос.УстановитьПараметр("НачалоПериода",				Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",				Объект.КонецПериода);
	Запрос.УстановитьПараметр("МинимальноеКоличествоДней",	Объект.МинимальноеКоличествоДнейПоУмолчанию);
	Запрос.УстановитьПараметр("МаксимальноеКоличествоДней",	Объект.МаксимальноеКоличествоДнейПоУмолчанию);
	
	//формируем таблицу периодов
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Если КоличествоМесяцев > 12 Тогда //колонки периодов - это года
		
		ТекущееНачалоПериода 	= Объект.НачалоПериода;
		ТекущийКонецПериода 	= ДобавитьМесяц(ТекущееНачалоПериода,12) - 1;
		
		Сч = 1;
		
		Пока ТекущийКонецПериода <= Объект.КонецПериода Цикл
			
			НоваяСтрока = ТаблицаПериодов.Добавить();
			НоваяСтрока.Период = ТекущееНачалоПериода;
			
			ТекущееНачалоПериода 	= ТекущийКонецПериода + 1;
			ТекущийКонецПериода 	= ДобавитьМесяц(ТекущееНачалоПериода,12) - 1;
			
			Сч = Сч + 1;
			
		КонецЦикла;	
		
	Иначе //колонки периодов - это месяца
		
		ТекущееНачалоПериода 	= Объект.НачалоПериода;
		ТекущийКонецПериода 	= ДобавитьМесяц(ТекущееНачалоПериода,1) - 1;
		
		Сч = 1;
		
		Пока ТекущийКонецПериода <= Объект.КонецПериода Цикл
			
			НоваяСтрока = ТаблицаПериодов.Добавить();
			НоваяСтрока.Период = ТекущееНачалоПериода;
			
			ТекущееНачалоПериода 	= ТекущийКонецПериода + 1;
			ТекущийКонецПериода 	= ДобавитьМесяц(ТекущееНачалоПериода,1) - 1;
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаПериодов",ТаблицаПериодов);
	
	
	
	Объект.РасчетЗапасов.Очистить();
	
	//теперь нужно добавлять строки, разбрасывать по периодам и считать количества...
	ВыборкаПоНоменклатуре = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		
		ВыборкаПоХарактеристикам = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоХарактеристикам.Следующий() Цикл
			
			НоваяСтрока = Объект.РасчетЗапасов.Добавить();
			НоваяСтрока.Номенклатура 				= ВыборкаПоХарактеристикам.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры 	= ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры;
			//+Смирнов 24.05.2021 № 56724
			НоваяСтрока.СтатусСбыта 				= ВыборкаПоХарактеристикам.Номенклатура.СтатусСбыта;
			НоваяСтрока.НеИспользоватьПриФормированииЗаказаПоставщику = НоваяСтрока.Номенклатура.НеИспользоватьПриФормированииЗаказовПоставщику;
			//-Смирнов 24.05.2021 № 56724
			
			ВыборкаПоПериоду = ВыборкаПоХарактеристикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Сч = 1;
			
			Пока ВыборкаПоПериоду.Следующий() Цикл 
				
				НоваяСтрока.ПериодИтого 	= НоваяСтрока.ПериодИтого + ВыборкаПоПериоду.Отгужено;
				НоваяСтрока["Период" + Сч] 	= ВыборкаПоПериоду.Отгужено;
				
				НоваяСтрока.МинимальноеКоличествоДней 	= ВыборкаПоПериоду.МинимальноеКоличествоДней;
				НоваяСтрока.МаксимальноеКоличествоДней 	= ВыборкаПоПериоду.МаксимальноеКоличествоДней;
				НоваяСтрока.Остаток 					= ВыборкаПоПериоду.Остаток;
				//АсТБ_Alexey_56724_********************************************************************
				//+Смирнов 24.05.2021  № 56724
				//ЗаказаноКоличество = ПолучитьЗаказано(ТЗСклады,НоваяСтрока.Номенклатура,НоваяСтрока.ХарактеристикаНоменклатуры,Объект.Организация,Объект.КонецПериода);    
				//НоваяСтрока.Заказано 					= ЗаказаноКоличество;
				//-Смирнов 24.05.2021 № 56724
				НоваяСтрока.Заказано 					= ВыборкаПоПериоду.Заказано;
				//АсТБ_Alexey_56724_********************************************************************
				НоваяСтрока.КраснаяЛиния 				= ВыборкаПоПериоду.КраснаяЛиния;
				НоваяСтрока.СрокДоставки 				= ВыборкаПоПериоду.СрокДоставки;
				
				Сч = Сч + 1;
				
			КонецЦикла;
			
			НоваяСтрока.Ежедневно 					= НоваяСтрока.ПериодИтого / КоличествоДней;
			НоваяСтрока.Ежемесячно 					= НоваяСтрока.ПериодИтого / КоличествоМесяцев;	
			НоваяСтрока.РекомендуетсяМинимально 	= Окр(НоваяСтрока.МинимальноеКоличествоДней * НоваяСтрока.Ежедневно,0,РежимОкругления.Окр15как20);
			НоваяСтрока.РекомендуетсяМаксимально 	= Окр(НоваяСтрока.МаксимальноеКоличествоДней * НоваяСтрока.Ежедневно,0,РежимОкругления.Окр15как20);
			
			//+Смирнов 31.05.2021 № 56724
			Если Объект.ЗаказатьСУчетомКараснойЛинии Тогда
				РекомендуетсяКЗаказуКЛ = НоваяСтрока.РекомендуетсяМаксимально - НоваяСтрока.Остаток -НоваяСтрока.Заказано;
				Если РекомендуетсяКЗаказуКЛ<=НоваяСтрока.КраснаяЛиния Тогда
					НоваяСтрока.РекомендуетсяКЗаказу=НоваяСтрока.КраснаяЛиния;
				Иначе
					НоваяСтрока.РекомендуетсяКЗаказу = РекомендуетсяКЗаказуКЛ; 
				КонецЕсли;
			Иначе
				Если НоваяСтрока.Остаток >= НоваяСтрока.РекомендуетсяМинимально Тогда
					НоваяСтрока.РекомендуетсяКЗаказу = НоваяСтрока.РекомендуетсяМаксимально - НоваяСтрока.Остаток - НоваяСтрока.Заказано;//+ НоваяСтрока.КраснаяЛиния;				
				КонецЕсли;
			КонецЕсли;
			//-Смирнов 31.05.2021 № 56724
			
			
		КонецЦикла;
		
	КонецЦикла;
	
	//+Смирнов 24.05.2021 № 56724
	Если Объект.ЗаказатьСУчетомКараснойЛинии Тогда
		ЗапросКЛ.УстановитьПараметр("ТаблицаПериодов",ТаблицаПериодов);
		ВыборкаПоНоменклатуреКЛ = ЗапросКЛ.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоНоменклатуреКЛ.Следующий() Цикл
			
			ВыборкаПоХарактеристикамКЛ = ВыборкаПоНоменклатуреКЛ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоХарактеристикамКЛ.Следующий() Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура",ВыборкаПоХарактеристикамКЛ.Номенклатура);
				Отбор.Вставить("ХарактеристикаНоменклатуры",ВыборкаПоХарактеристикамКЛ.ХарактеристикаНоменклатуры); 
				НайденныеСтроки = Объект.РасчетЗапасов.НайтиСтроки(Отбор);
				
				Если  НайденныеСтроки.Количество()=0 ТОгда
					НоваяСтрока = Объект.РасчетЗапасов.Добавить();
					
					
					НоваяСтрока.Номенклатура 				= ВыборкаПоХарактеристикамКЛ.Номенклатура;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= ВыборкаПоХарактеристикамКЛ.ХарактеристикаНоменклатуры;
					НоваяСтрока.СтатусСбыта 				= ВыборкаПоХарактеристикамКЛ.Номенклатура.СтатусСбыта;
					НоваяСтрока.НеИспользоватьПриФормированииЗаказаПоставщику = НоваяСтрока.Номенклатура.НеИспользоватьПриФормированииЗаказовПоставщику;
					
					ВыборкаПоПериодуКЛ = ВыборкаПоХарактеристикамКЛ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Сч = 1;
					
					Пока ВыборкаПоПериодуКЛ.Следующий() Цикл 
						
						НоваяСтрока.ПериодИтого 	= НоваяСтрока.ПериодИтого;
						НоваяСтрока["Период" + Сч] 	= 0;
						
						НоваяСтрока.МинимальноеКоличествоДней 	= "";
						НоваяСтрока.МаксимальноеКоличествоДней 	= "";
						НоваяСтрока.Остаток 					= ВыборкаПоПериодуКЛ.Остаток;
						//АсТБ_Alexey_56724_********************************************************************
						//+Смирнов 24.05.2021  № 56724
						//ЗаказаноКоличество = ПолучитьЗаказано(ТЗСклады,НоваяСтрока.Номенклатура,НоваяСтрока.ХарактеристикаНоменклатуры,Объект.Организация,Объект.КонецПериода);    
						//НоваяСтрока.Заказано 					= ЗаказаноКоличество;
						//-Смирнов 24.05.2021 № 56724
						НоваяСтрока.Заказано 					= ВыборкаПоПериодуКЛ.Заказано;
						//АсТБ_Alexey_56724_********************************************************************
						
						НоваяСтрока.КраснаяЛиния 				= ВыборкаПоПериодуКЛ.КраснаяЛиния;
						НоваяСтрока.СрокДоставки 				= ВыборкаПоПериодуКЛ.СрокДоставки;
						
						Сч = Сч + 1;
						
					КонецЦикла;
					
					НоваяСтрока.Ежедневно 					= НоваяСтрока.ПериодИтого / КоличествоДней;
					НоваяСтрока.Ежемесячно 					= НоваяСтрока.ПериодИтого / КоличествоМесяцев;	
					НоваяСтрока.РекомендуетсяМинимально 	= Окр(НоваяСтрока.МинимальноеКоличествоДней * НоваяСтрока.Ежедневно,0,РежимОкругления.Окр15как20);
					НоваяСтрока.РекомендуетсяМаксимально 	= Окр(НоваяСтрока.МаксимальноеКоличествоДней * НоваяСтрока.Ежедневно,0,РежимОкругления.Окр15как20);
					
					РекомендуетсяКЗаказуКЛ = 0;
					РекомендуетсяКЗаказуКЛ = НоваяСтрока.РекомендуетсяМаксимально - НоваяСтрока.Остаток -НоваяСтрока.Заказано;
					Если РекомендуетсяКЗаказуКЛ<=НоваяСтрока.КраснаяЛиния Тогда
						НоваяСтрока.РекомендуетсяКЗаказу=НоваяСтрока.КраснаяЛиния;
					Иначе
						НоваяСтрока.РекомендуетсяКЗаказу = РекомендуетсяКЗаказуКЛ; 
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	//-Смирнов 24.05.2021 № 56724
	
	
	
КонецПроцедуры

//+Смирнов 24.05.2021 № 56724
&НаСервере
Функция ПолучитьЗаказано(Склады, Номенклатура, ХарактеристикаНоменклатуры, Организация, Период)
	
	ЗапросЗаказано = Новый Запрос;
	ЗапросЗаказано.Текст = "ВЫБРАТЬ
	|	ЗаказыПоставщикуОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикуОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ЗаказыПоставщикуОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщику.Остатки(
	|			&Дата,
	|			Склад В (&Склад)
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|				И Организация = &Организация) КАК ЗаказыПоставщикуОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикуОстатки.Номенклатура,
	|	ЗаказыПоставщикуОстатки.ХарактеристикаНоменклатуры";
	ЗапросЗаказано.УстановитьПараметр("Склад", Склады);
	ЗапросЗаказано.УстановитьПараметр("Номенклатура", Номенклатура);
	ЗапросЗаказано.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	ЗапросЗаказано.УстановитьПараметр("Организация", Организация);
	ЗапросЗаказано.УстановитьПараметр("Дата", Период); 
	РезультатЗаказано = ЗапросЗаказано.Выполнить().Выгрузить();
	Если РезультатЗаказано.Количество()<>0 Тогда
		Возврат РезультатЗаказано[0].КоличествоОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
//-Смирнов 24.05.2021 № 56724

&НаКлиенте
Процедура ВыполнитьРасчет(Команда)
	
	ВыполнитьРасчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗапасовМинимальноеКоличествоДнейПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасчетЗапасов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.МинимальноеКоличествоДней >= ТекущаяСтрока.МаксимальноеКоличествоДней Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Значение задано неверно!";
		СообщениеПользователю.Сообщить(); 
		ТекущаяСтрока.МинимальноеКоличествоДней = ТекущаяСтрока.МаксимальноеКоличествоДней - 1;
	КонецЕсли;	
	
	ТекущаяСтрока.РекомендуетсяМинимально = Окр(ТекущаяСтрока.МинимальноеКоличествоДней * ТекущаяСтрока.Ежедневно,0,РежимОкругления.Окр15как20);
	
	Если ТекущаяСтрока.Остаток <= ТекущаяСтрока.РекомендуетсяМинимально Тогда
		ТекущаяСтрока.РекомендуетсяКЗаказу = ТекущаяСтрока.РекомендуетсяМаксимально - ТекущаяСтрока.Остаток;				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗапасовМаксимальноеКоличествоДнейПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасчетЗапасов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.МинимальноеКоличествоДней >= ТекущаяСтрока.МаксимальноеКоличествоДней Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Значение задано неверно!";
		СообщениеПользователю.Сообщить(); 
		ТекущаяСтрока.МаксимальноеКоличествоДней = ТекущаяСтрока.МинимальноеКоличествоДней + 1;
	КонецЕсли;	
	
	ТекущаяСтрока.РекомендуетсяМаксимально 	= Окр(ТекущаяСтрока.МаксимальноеКоличествоДней * ТекущаяСтрока.Ежедневно,0,РежимОкругления.Окр15как20);
	
	Если ТекущаяСтрока.Остаток <= ТекущаяСтрока.РекомендуетсяМинимально Тогда
		ТекущаяСтрока.РекомендуетсяКЗаказу = ТекущаяСтрока.РекомендуетсяМаксимально - ТекущаяСтрока.Остаток;				
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗапасовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАнализаПриИзменении(Элемент)
	
	Объект.РасчетЗапасов.Очистить();
	
	Объект.НачалоПериода	= НачалоМесяца(ПериодАнализа.ДатаНачала);
	
	ОбработатьИзменениеПериодаАнализа();
	
	Объект.КонецПериода 	= КонецМесяца(ПериодАнализа.ДатаОкончания);
	
	НастроитьКолонкиТаблицы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПериодаАнализа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(&ДатаНачала, ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, МЕСЯЦ) > 144
	|				ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, 144), МЕСЯЦ)
	|			ИНАЧЕ &ДатаОкончания
	|		КОНЕЦ, ДЕНЬ) КАК КоличествоДней,
	|	РАЗНОСТЬДАТ(&ДатаНачала, ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, МЕСЯЦ) > 144
	|				ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, 144), МЕСЯЦ)
	|			ИНАЧЕ &ДатаОкончания
	|		КОНЕЦ, МЕСЯЦ) КАК КоличествоМесяцев,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, МЕСЯЦ) > 144
	|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, 144), МЕСЯЦ)
	|		ИНАЧЕ &ДатаОкончания
	|	КОНЕЦ КАК КонецПериода";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ПериодАнализа.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(ПериодАнализа.ДатаОкончания)+1);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	КоличествоДней 				= ТаблицаЗапроса[0].КоличествоДней;
	КоличествоМесяцев 			= ТаблицаЗапроса[0].КоличествоМесяцев; 
	ПериодАнализа.ДатаОкончания = ТаблицаЗапроса[0].КонецПериода - 1;
	
КонецПроцедуры	

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Объект.РасчетЗапасов.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьПараметрВСпискеНоменклатуры();
	
	Объект.РасчетЗапасов.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрВСпискеНоменклатуры()
	
	Если УчетОстатковПоОрганизации Тогда
		Номенклатура.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	Иначе
		Номенклатура.Параметры.УстановитьЗначениеПараметра("Организация", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьВидимостьКолонок()
	
	Для Сч = 1 По 12 Цикл
		
		Элементы.РасчетЗапасов.ПодчиненныеЭлементы.РасчетЗапасовГруппа5.ПодчиненныеЭлементы["РасчетЗапасовПериод" + Сч].Видимость = Ложь;
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура НастроитьКолонкиТаблицы()
	
	СброситьВидимостьКолонок();
	
	Если КоличествоМесяцев > 12 Тогда //колонки периодов - это года
		
		ТекущееНачалоПериода 	= Объект.НачалоПериода;
		ТекущийКонецПериода 	= ДобавитьМесяц(ТекущееНачалоПериода,12) - 1;
		
		Сч = 1;
		
		Пока ТекущийКонецПериода <= Объект.КонецПериода Цикл
			
			Элементы.РасчетЗапасов.ПодчиненныеЭлементы.РасчетЗапасовГруппа5.ПодчиненныеЭлементы["РасчетЗапасовПериод" + Сч].Видимость = Истина;
			Элементы.РасчетЗапасов.ПодчиненныеЭлементы.РасчетЗапасовГруппа5.ПодчиненныеЭлементы["РасчетЗапасовПериод" + Сч].Заголовок = ПредставлениеПериода(ТекущееНачалоПериода,ТекущийКонецПериода,"ДФ=yyyy");
			
			ТекущееНачалоПериода 	= ТекущийКонецПериода + 1;
			ТекущийКонецПериода 	= ДобавитьМесяц(ТекущееНачалоПериода,12) - 1;
			
			Сч = Сч + 1;
			
		КонецЦикла;	
		
	Иначе //колонки периодов - это месяца
		
		ТекущееНачалоПериода 	= Объект.НачалоПериода;
		ТекущийКонецПериода 	= ДобавитьМесяц(ТекущееНачалоПериода,1) - 1;
		
		Сч = 1;
		
		Пока ТекущийКонецПериода <= Объект.КонецПериода Цикл
			
			Элементы.РасчетЗапасов.ПодчиненныеЭлементы.РасчетЗапасовГруппа5.ПодчиненныеЭлементы["РасчетЗапасовПериод" + Сч].Видимость = Истина;
			Элементы.РасчетЗапасов.ПодчиненныеЭлементы.РасчетЗапасовГруппа5.ПодчиненныеЭлементы["РасчетЗапасовПериод" + Сч].Заголовок = ПредставлениеПериода(ТекущееНачалоПериода,ТекущийКонецПериода,"ДФ='MMMM yyyy'");
			
			ТекущееНачалоПериода 	= ТекущийКонецПериода + 1;
			ТекущийКонецПериода 	= ДобавитьМесяц(ТекущееНачалоПериода,1) - 1;
			
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере(ТекущаяОрганизация,ТекущаяНоменклатура,ТекущаяХарактеристикаНоменклатуры)
	
	НаборЗаписей = РегистрыСведений.ПараметрыУправленияЗапасами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(ТекущаяОрганизация);
	НаборЗаписей.Отбор.Номенклатура.Установить(ТекущаяНоменклатура);
	НаборЗаписей.Отбор.ХарактеристикаНоменклатуры.Установить(ТекущаяХарактеристикаНоменклатуры);
	НаборЗаписей.Прочитать();
	
	Если НЕ НаборЗаписей.Количество() = 0 Тогда
		
		НаборЗаписей[0].МинимальноеКоличествоДней 	= Объект.МинимальноеКоличествоДнейПоУмолчанию;
		НаборЗаписей[0].МаксимальноеКоличествоДней 	= Объект.МаксимальноеКоличествоДнейПоУмолчанию;
		
	Иначе
		
		НоваяЗапись 							= НаборЗаписей.Добавить();
		НоваяЗапись.Организация 				= ТекущаяОрганизация;
		НоваяЗапись.Номенклатура 				= ТекущаяНоменклатура;
		НоваяЗапись.ХарактеристикаНоменклатуры 	= ТекущаяХарактеристикаНоменклатуры;
		НоваяЗапись.МинимальноеКоличествоДней 	= Объект.МинимальноеКоличествоДнейПоУмолчанию;
		НоваяЗапись.МаксимальноеКоличествоДней 	= Объект.МаксимальноеКоличествоДнейПоУмолчанию;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
	
	Если УчетОстатковПоОрганизации Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не задана организация";
			СообщениеПользователю.Сообщить();
			Возврат;
		Иначе
			ТекущаяОрганизация = Объект.Организация;
		КонецЕсли;	
	Иначе
		ТекущаяОрганизация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Номенклатура.ВыделенныеСтроки Цикл
		
		ТекущаяНоменклатура 				= Элементы.Номенклатура.ДанныеСтроки(ВыделеннаяСтрока).Номенклатура;
		ТекущаяХарактеристикаНоменклатуры 	= Элементы.Номенклатура.ДанныеСтроки(ВыделеннаяСтрока).ХарактеристикаНоменклатуры;
		ЗаполнитьПараметрыНаСервере(ТекущаяОрганизация,ТекущаяНоменклатура,ТекущаяХарактеристикаНоменклатуры);
		
	КонецЦикла;
	
	УстановитьПараметрВСпискеНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаказПоставщикуНаСервере()
	
	ТаблицаДляФормированияДокументов = Новый ТаблицаЗначений;
	ТаблицаДляФормированияДокументов.Колонки.Добавить("Организация",				Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДляФормированияДокументов.Колонки.Добавить("Склад",						Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаДляФормированияДокументов.Колонки.Добавить("НачалоПериодаВыдачи",		Новый ОписаниеТипов("Дата"));
	ТаблицаДляФормированияДокументов.Колонки.Добавить("КонецПериодаВыдачи",			Новый ОписаниеТипов("Дата"));
	ТаблицаДляФормированияДокументов.Колонки.Добавить("Поставщик",					Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДляФормированияДокументов.Колонки.Добавить("Номенклатура",				Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДляФормированияДокументов.Колонки.Добавить("ХарактеристикаНоменклатуры",	Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДляФормированияДокументов.Колонки.Добавить("Количество",					Новый ОписаниеТипов("Число"));
	//+Смирнов 28.05.2021 №56724
	ТаблицаДляФормированияДокументов.Колонки.Добавить("НеИспользоватьПриФормированииЗаказаПоставщику",	Новый ОписаниеТипов("Булево"));
	//+Смирнов 28.05.2021 №56724
	
	Для Каждого СтрокаТаблицы Из Объект.РасчетЗапасов Цикл
		
		Если СтрокаТаблицы.РекомендуетсяКЗаказу = 0 Тогда
			ПРодолжить;
		КонецЕсли;
		
		НоваяСтрока 							= ТаблицаДляФормированияДокументов.Добавить();
		НоваяСтрока.Организация 				= Объект.Организация;
		НоваяСтрока.Склад 						= Объект.Склад;
		НоваяСтрока.НачалоПериодаВыдачи 		= Объект.НачалоПериода;
		НоваяСтрока.КонецПериодаВыдачи 			= КонецМесяца(Объект.НачалоПериода);
		НоваяСтрока.Поставщик 					= Объект.Поставщик;
		НоваяСтрока.Номенклатура 				= СтрокаТаблицы.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаТаблицы.ХарактеристикаНоменклатуры;
		НоваяСтрока.Количество 					= СтрокаТаблицы.РекомендуетсяКЗаказу;
		//+Смирнов 28.05.2021 №56724
		НоваяСтрока.НеИспользоватьПриФормированииЗаказаПоставщику = СтрокаТаблицы.НеИспользоватьПриФормированииЗаказаПоставщику;
		//+Смирнов 28.05.2021 №56724
		
	КонецЦикла;
	
	Если ТаблицаДляФормированияДокументов.Количество() = 0 Тогда
		Сообщить("Формирование заказов поставщику не требуется.");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДляФормированияДокументов.Организация КАК Организация,
	|	ТаблицаДляФормированияДокументов.Склад КАК Склад,
	|	ТаблицаДляФормированияДокументов.НачалоПериодаВыдачи КАК НачалоПериодаВыдачи,
	|	ТаблицаДляФормированияДокументов.КонецПериодаВыдачи КАК КонецПериодаВыдачи,
	|	ТаблицаДляФормированияДокументов.Номенклатура КАК Номенклатура,
	|	ТаблицаДляФормированияДокументов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаДляФормированияДокументов.Количество КАК Количество,
	|	ТаблицаДляФормированияДокументов.Поставщик КАК Поставщик,
	|	ТаблицаДляФормированияДокументов.НеИспользоватьПриФормированииЗаказаПоставщику КАК НеИспользоватьПриФормированииЗаказаПоставщику
	|ПОМЕСТИТЬ ТаблицаДляФормированияДокументов
	|ИЗ
	|	&ТаблицаДляФормированияДокументов КАК ТаблицаДляФормированияДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДляФормированияДокументов.Организация КАК Организация,
	|	ТаблицаДляФормированияДокументов.Склад КАК Склад,
	|	ТаблицаДляФормированияДокументов.НачалоПериодаВыдачи КАК НачалоПериодаВыдачи,
	|	ТаблицаДляФормированияДокументов.КонецПериодаВыдачи КАК КонецПериодаВыдачи,
	|	ТаблицаДляФормированияДокументов.Номенклатура КАК Номенклатура,
	|	ТаблицаДляФормированияДокументов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаДляФормированияДокументов.Количество КАК Количество,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ТаблицаДляФормированияДокументов.Количество КАК Сумма,
	|	ТаблицаДляФормированияДокументов.Поставщик КАК Поставщик,
	|	ТаблицаДляФормированияДокументов.НеИспользоватьПриФормированииЗаказаПоставщику КАК НеИспользоватьПриФормированииЗаказаПоставщику
	|ИЗ
	|	ТаблицаДляФормированияДокументов КАК ТаблицаДляФормированияДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|			МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|			ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик,
	|			ЦеныНоменклатурыСрезПоследних.Организация КАК Организация
	|		ИЗ
	|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|					&Период,
	|					Организация = &Организация
	|						ИЛИ &НеУчитыватьОстаткиПоОрганизации) КАК ЦеныНоменклатурыСрезПоследних
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|			ЦеныНоменклатурыСрезПоследних.Поставщик,
	|			ЦеныНоменклатурыСрезПоследних.Организация) КАК ЦеныНоменклатуры
	|		ПО ТаблицаДляФормированияДокументов.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ТаблицаДляФормированияДокументов.Поставщик = ЦеныНоменклатуры.Поставщик
	|			И ТаблицаДляФормированияДокументов.Организация = ЦеныНоменклатуры.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Склад,
	|	НачалоПериодаВыдачи";
	
	Запрос.УстановитьПараметр("ТаблицаДляФормированияДокументов",	ТаблицаДляФормированияДокументов);
	Запрос.УстановитьПараметр("Период",								КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("Организация",						Объект.Организация);
	Запрос.УстановитьПараметр("НеУчитыватьОстаткиПоОрганизации",	НЕ УчетОстатковПоОрганизации);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаДляФормированияДокументов = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	СвернутаяТаблица = ТаблицаДляФормированияДокументов.Скопировать();
	СвернутаяТаблица.Свернуть("Организация,Склад,Поставщик,НачалоПериодаВыдачи");
	
	Для Каждого СтрокаСвернутойТаблицы Из СвернутаяТаблица Цикл
		
		НовыйДокумент 						= Документы.ЗаказПоставщику.СоздатьДокумент();
		НовыйДокумент.Дата 					= ТекущаяДата();
		НовыйДокумент.Организация 			= СтрокаСвернутойТаблицы.Организация;
		//+Смирнов 21.05.2021 № 56724
		//НовыйДокумент.Склад 				= СтрокаСвернутойТаблицы.Склад;
		НовыйДокумент.Склад 				= Справочники.Склады.ПустаяСсылка();
		//-Смирнов 21.05.2021 № 56724
		НовыйДокумент.НачалоПериодаВыдачи 	= СтрокаСвернутойТаблицы.НачалоПериодаВыдачи;
		НовыйДокумент.КонецПериодаВыдачи 	= КонецМесяца(СтрокаСвернутойТаблицы.НачалоПериодаВыдачи);
		НовыйДокумент.Поставщик 			= СтрокаСвернутойТаблицы.Поставщик;
		НовыйДокумент.Ответственный			= ПараметрыСеанса.ТекущийПользователь;
		НовыйДокумент.СоздательДокумента	= ПараметрыСеанса.ТекущийПользователь;
		//АсТБ_Alexey_56927_********************************************************************
		НовыйДокумент.СпособСоздания 		= Перечисления.СпособыСозданияЗаказовПоставщику.СформированУправлениемЗапасами;
		//АсТБ_Alexey_56927*********************************************************************
		
		СтруктураПоиска = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаСвернутойТаблицы);
		
		НайденныеСтроки = ТаблицаДляФормированияДокументов.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			//+Смирнов 28.05.2021 №56724
			Если  НЕ НайденнаяСтрока.НеИспользоватьПриФормированииЗаказаПоставщику Тогда
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрока);
			КонецЕсли;
			//-Смирнов 28.05.2021 №56724
		КонецЦикла;
		
		НовыйДокумент.СуммаДокумента = НовыйДокумент.Товары.Итог("Сумма");
		НовыйДокумент.УстановитьНовыйНомер();
		//+Смирнов 21.05.2021 № 56724
		//НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		//-Смирнов 21.05.2021 № 56724
		Сообщение = Новый СообщениеПользователю;
		Сообщение.КлючДанных = НовыйДокумент.Ссылка;
		Сообщение.Текст = "Сформирован документ: " + НовыйДокумент.Ссылка;
		Сообщение.Сообщить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаказПоставщику(Команда)
	
	СформироватьЗаказПоставщикуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура МинимальноеКоличествоДнейПоУмолчанию1ПриИзменении(Элемент)
	
	Если Объект.МинимальноеКоличествоДнейПоУмолчанию >= Объект.МаксимальноеКоличествоДнейПоУмолчанию Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Значение задано неверно!";
		СообщениеПользователю.Сообщить(); 
		Объект.МинимальноеКоличествоДнейПоУмолчанию = Объект.МаксимальноеКоличествоДнейПоУмолчанию - 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальноеКоличествоДнейПоУмолчанию1ПриИзменении(Элемент)
	
	Если Объект.МинимальноеКоличествоДнейПоУмолчанию >= Объект.МаксимальноеКоличествоДнейПоУмолчанию Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Значение задано неверно!";
		СообщениеПользователю.Сообщить(); 
		Объект.МаксимальноеКоличествоДнейПоУмолчанию = Объект.МинимальноеКоличествоДнейПоУмолчанию + 1;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПоУмолчанию(Команда)
	
	Объект.МинимальноеКоличествоДнейПоУмолчанию 	= 60;
	Объект.МаксимальноеКоличествоДнейПоУмолчанию 	= 90;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	Объект.РасчетЗапасов.Очистить();
	
КонецПроцедуры
